-- Заполняем таблицу texts
-- Предполагается, что id генерируется автоматически (IDENTITY или SERIAL), иначе нужно указать id вручную
-- DROP table if exists text_entity;

INSERT INTO text_entity (group_name, content)
VALUES ('A', 'Осенью 1925 года я поступил в Академию наук лаборантом геологического музея.

Казалось бы, мне оставалось только закончить университет. На деле получилось совсем не так. Разнообразная деятельность лаборанта, сама наука так увлекли меня, что я часто засиживался в лаборатории до ночи. Всё труднее становилось совмещать столь интенсивную работу с занятиями. К тому же с весны до глубокой осени приходилось бывать в экспедициях. Вскоре я совсем оставил занятия, будучи не в силах совмещать дальние экспедиции в Среднюю Азию и Сибирь, где я уже работал в качестве геолога, хотя и не имел ещё диплома.

Мне посчастливилось быть в рядах тех геологов, которые открыли пути ко многим важным месторождениям полезных ископаемых. Эта трудная работа так увлекала нас, что мы забывали всё. Забыл и я о своём учении.

Я то и дело спотыкался, когда приходилось отстаивать свои взгляды или выставлять проекты новых исследований, терялся, когда необходимо было «защищать» открытые месторождения. Наконец мне стало ясно, что без высшего образования мне встретится слишком много досадных препятствий. Будучи уже квалифицированным геологом, я ходатайствовал о разрешении, в порядке исключения, окончить экстерном Ленинградский горный институт. Мне пошли навстречу, и в течение двух с половиной лет удалось, не прерывая работы, закончить его.

Сколько я каялся и бранил себя за то, что оставил учение и не довёл его до конца раньше, когда у меня было ещё мало обязанностей, накоплено мало исследований, требовавших спешного завершения!

Сейчас, когда я, пожилой, много видевший учёный и писатель, смотрю в прошлое, мне ясно, что стремление и воля к знаниям не оставляли меня. Я пробивался к знаниям, чувствуя и понимая, какой огромный и широкий мир открывается передо мной в книгах, исследованиях, путешествиях. Но каковы бы ни были мои способности и желания, сделать доступным всё духовное богатство мира могло лишь систематическое образование. Всё это: школа и уроки, диктовки и задачи – было трудным препятствием, но в то же время и ключом, открывшим ворота в новое, интересное, прекрасное.

Мне повезло с учителями: на пути оказались хорошие, высокой души люди. Настоящие педагоги, сумевшие разглядеть в малообразованном, плохо воспитанном, подчас просто грубом мальчишке какие-то способности. Но мне думается, что если бы этого не случилось, то всё равно я продолжал бы преодолевать все трудности учения. Воля, как и всё остальное, требует закалки и упражнения. То, что казалось трудным вчера, становится лёгким сегодня, если не уступать минутной слабости, а бороться с собой шаг за шагом, экзамен за экзаменом.

Тренировка стойкости и воли проходит незаметно. Когда учишься ездить на автомашине, трудно справляться с ней и следить за дорогой, знаками, пешеходами. И вдруг вы перестаёте замечать свои действия, машина становится послушной и не требующей напряжённого внимания. Так и с трудностями учения. Привычка к их преодолению приходит незаметно, учиться становится легко, только нельзя давать себе распускаться и жалобиться. Товарищи будут с уважением называть такого человека собранным, волевым, мужественным, а он будет удивляться: что такого в нём нашли особенного?

И если вы действительно стремитесь к знаниям, то не поддавайтесь слабости, никогда не отменяйте своего решения! Дорогу осиливает и ослабевший человек, пока он идёт. Но если он присядет отдохнуть, ему будет трудно подняться, много труднее, чем продолжать идти!
'),
       ('A', 'Лишь совсем недавно человек узнал, что Земля — это шар. Думали, стоит Земля на трёх слонах, а ночью звёздный мир укрывает Землю. Теперь вокруг шара человек облетает менее чем за два часа. 3емлю можно увидеть со стороны. Вот снимок, сделанный из космоса. Да, Земля — это шар, на нём видны материки, моря, облака, восходы и заходы Солнца. Подробности земной жизни издалека не видны, но они есть, их много...

Два десятка лет назад американцы провели опрос учёных: что дали человечеству полёты в космос? Ответы были интересные. Мне запомнился этот: «Во Вселенной мы одни, и не похоже, что где-нибудь нас ждут. Надо беречь свой дом — родную Землю». Хороший ответ.

Сегодня с высоты своих знаний человек может сказать: «Замечательная нам досталась планета». В самом деле, есть на планете вода, без которой жизнь была бы невозможной. Близость Солнца даёт не иссякающее от времени тепло.

 Вращение Земли обеспечивает чередование дней и ночей на планете, смену времён года. 3елёные растения наполняют атмосферу кислородом, накапливают углерод и выделяют в верхние слои атмосферы животворный кислород и озон, прикрывающий всё живое от губительных лучей Солнца.

Конечно, зародившейся жизни миллионы лет приходилось приспосабливаться к изначальным условиям на планете. Живые организмы уступали место на Земле более совершенным. От многих животных уцелели лишь кости. Но некоторые дожили до наших времён. Живут в океанской воде на грани истребления человеком громадные киты — самые большие существа, когда-либо жившие на Земле. Самые маленькие из млекопитающих — крохотная мышь- малютка и землеройка, весящая всего два грамма.

Между китами и мышами — огромное число животных, которым Земля стала родным домом. И во главе всего сущего стоит человек. Он часто решает, кому жить, а кому в жизни отказано.

Миллионы лет отбирала Природа животных, определяя места, где они могут жить, чем могут кормиться. Человек давно изучил эти места и первым тянется к добыче, разрушает среду, где привычно и благополучно живут звери, птицы, рыбы. Так разрушаются основы нашего общего Дома.

Много животных исчезли или стали исключительно редкими. Уже давно мы не видим пролетающих журавлей, мало кто слышит токующих глухарей, крик перепёлок. И так везде на Земле. Двести лет назад американцы варварски истребили миллионы бизонов, а в середине прошлого века химия подкосила в Америке культовую птицу — белоголового орлана. В Африке на больших пространствах уничтожили тысячи носорогов — нужна была земля для посевов зерна. Растут площади жарких пустынь и пустошей, истощаются плодородные земли, высыхают озёра, исчезают на равнинах малые реки.

Вот что имел в виду учёный, ответивший на вопрос о космосе. Планету Земля нам надо беречь. Никто не ждёт нашей высадки на другие планеты. А Земля по-прежнему нас кормит, даёт нам дышать, снабжает водой, теплом и радостью жизни, идущей от наших соседей: зверей, птиц, рыб, насекомых, образующих сложный узор жизни на нашей планете.

Вот как выглядит Земля, если глянуть на неё со стороны. Очертания материков. Следы деятельности вулканов. Огни больших городов и маленьких деревень. Озёра на суше. Острова в океане. 3емля, изрытая шахтами и лисьими норами. 3емля, покрытая следами зверей, хлебными полями и кудрями лесов... Такой общий наш Дом.
'),
       ('B', 'Въехали в город. Снова раздался звонок мобильного. Опять Сашка:
– Ну где ты там? Экзамен через пятнадцать минут! Уже все в аудитории! Ты-то ещё сдашь, а мне без тебя конец!
Вместо ответа Серёжа вдруг спросил:
– Ты знаешь адрес травматологии?
– Что случилось, что с тобой? – заволновался Сашка.
– Да бабушке надо!
– Какой бабушке? О чём ты? Не знаю я никакого адреса! – завопил в трубку приятель.
Серёжа нажал на кнопку телефона. Бабушка в отчаянии продолжала просить водителя подвезти её поближе к отделению, куда направили её сельские врачи на лечение, объясняя, что не дойти ей самой – даже шаг ступить трудно. Тот отвечал уже не насмешливо, а крайне раздражённо и даже резко, что и остальным не так легко, как кажется, что у него пассажиры и он не собирается искать какой-то там корпус.
Тем временем все притихли, и тошно стало Серёже от тишины, и по груди разлился жар, что-то давило, щемило. «Ну что мы за чурбаны – и эти женщины, и этот мужчина, и водитель, и я: нет бы бабушку проводить, а я сижу молча, будто нет меня тут, будто оглох я и все оглохли…» Стыдно, что некому помочь бабушке, стыдно и самому помощь предложить. Скажут, что выскочка. Видел он, как покосилась на него соседка, когда он у Сашки адрес травматологии спрашивал.
Сидел Серёжа в волнении, а в душе его – буря, борьба, презрение к своей слабости.
Между тем водитель подъехал к главному корпусу краевой больницы, открыл дверь, и бабушка в смятении выбралась из маршрутного такси под недовольные вздохи пассажиров. Дверь захлопнулась, машина отъехала от здания. И вдруг Серёжа понял, что уходит мгновение, когда он ещё может помочь не только бедной старушке, но и самому себе. Помочь остаться человеком. А потом, через мгновение, будет поздно…
– Остановите! – крикнул Серёжа. – Мне тоже здесь!
Водитель притормозил.
– О Господи, то один, то другой! Мы доедем сегодня или нет?! – услышал Серёжа вслед чей-то недовольный голос.
Паренёк очутился на улице. Бабушка в растерянности стояла перед огромным современным зданием краевой больницы.
– Я вам помогу, провожу, сумку донесу, – сказал Серёжа, смутившись.
Бабушка удивлённо взглянула на него, и вдруг её старое и сморщенное лицо вдруг как бы помолодело и посветлело.
– Так вот она, голубчик, оказывается, травматология-то, к главному зданию пристроена! А ты опоздал, внучек, на экзамен-то! Прости уж меня, квочку старую, я тебя взбаламутила… А душенька у тебя, сынок, настоящая!
А Серёжа шёл со старушкой и думал о том, что невозможно быть настолько внимательным старому человеку. И про экзамен-то она знает, и что душа у него есть знает. И было ему в этот миг легко и весело…
'),
       ('B', 'Вот и кончился последний урок последнего дня нашей школьной жизни. Десять школьных лет завершились по знакомой хрипловатой трели звонка. Все мы, растроганные, взволнованные, радостные и о чём-то жалеющие, растерянные и смущённые своим мгновенным превращением из школяров во взрослых людей, слонялись по классам и коридору, словно страшась выйти из школьных стен в мир, ставший бесконечным. И было такое чувство, будто что-то недоговорено, не дожито, не исчерпано за прошедшие десять лет, будто этот день застал нас врасплох.

В класс заглянула Женя Румянцева:
‒ Серёжа, можно тебя на минутку? У меня странное предложение! Давай встретимся через десять лет!

Шутливость совсем не была свойственна Жене, и я спросил серьёзно:
‒ Зачем?
‒ Мне интересно, каким ты станешь. Ты ведь очень нравился мне все эти годы.

Я думал, что Жене Румянцевой неведомы ни эти слова, ни эти чувства. Вся её жизнь протекала в двух сферах: в напряжённой общественной работе и в мечтаниях о звёздных мирах. Немногие из нас твёрдо определили свой дальнейший жизненный путь, а Женя с шестого класса знала, что будет астрономом, и никем другим. Между нами никогда не было дружеской близости. В поисках разгадки я мысленно пробегал прошлое, но ничего не нашёл в нём, кроме одной встречи на Чистых прудах…

Однажды мы собирались в выходной день на Химкинское водохранилище покататься на лодках. Но с утра заморосил дождь, и на сборный пункт пришли только мы с Павликом, Нина и Женя Румянцева. Дождь не переставал ни на минуту. Нечего было и думать о Химках.

‒ Давайте покатаемся на пруду, ‒ предложил я и показал на старую, рассохшуюся лодку-плоскодонку: будем воображать, что мы в Химках.
‒ Или в Средиземном море, ‒ вставил Павлик.
‒ Или в Индийском океане, ‒ восторженно подхватила Женя.

Мы вычерпали из лодки воду и отправились в «кругосветное» плавание. Женя придумывала маршрут нашего путешествия. Вот мы проходим Босфор, через Суэцкий канал попадаем в Красное море, оттуда в Аравийское и входим в Тихий океан. Женя неутомимо командовала: «Право руля!», «Лево руля!», «Поднять паруса!», «Убрать паруса!» Отыскивала путь по звёздам: наш компас разбился во время бури.

Больше Женя не бывала с нами. Мы не раз приглашали её на наши сборища, но она отказывалась. А что если в тот единственный раз она пришла из-за меня и из-за меня отступилась, сказав себе с гордой честностью: не вышло…
‒ Почему же ты раньше молчала, Женя? ‒ спросил я.
‒ К чему было говорить? Тебе так нравилась Нина!
С ощущением какой-то досадной и грустной утраты я сказал:
‒ Где же и когда мы встретимся?
‒ Через десять лет, двадцать девятого мая, в восемь часов вечера, в среднем пролёте между колонн Большого театра.

Минули годы, Женя училась в Ленинграде. Зимой 1941 года, жадно ловя известия о судьбе моих друзей, я узнал, что Женя в первый же день войны бросила институт и пошла в лётную школу. Летом 1944 года я услышал по радио указ о присвоении майору авиации Румянцевой звания Героя Советского Союза. Когда я вернулся с войны, то узнал, что звание Героя было присвоено Жене посмертно.

Жизнь шла дальше, порой я вдруг вспоминал о нашем уговоре, а за несколько дней до срока почувствовал такое острое, щемящее беспокойство, будто все прошедшие годы только и готовился к этой встрече. Я поехал к Большому театру, купил у цветочницы ландыши и пошёл к среднему пролёту между колонн Большого театра. Я постоял там немного, затем отдал ландыши какой-то худенькой сероглазой девушке и поехал домой…

Мне хотелось на миг остановить время, оглянуться на себя, на прожитые годы, вспомнить Женю, лодку, дождик, вспомнить слепоту своей юношеской души, так легко прошедшей мимо того, что могло бы стать судьбой.
');

-- Вопросы к первому тексту (id=1)
-- DROP table if exists question;

INSERT INTO question (text_id, question_text, option1, option2, option3, option4, correct_option_index)
VALUES
(
  1,
  'Какую роль играет образование в жизни человека?',
  'Образование помогает развить важные жизненные качества.',
  'Образование является ключом, открывающим ворота в новое, интересное, прекрасное.',
  'Образование позволяет человеку стать успешным в профессиональной сфере.',
  'Образование открывает доступ к духовному богатству мира.',
  3
),
(
  1,
  'Какие качества помогают человеку преодолевать трудности?',
  'Умение работать в команде.',
  'Способность к быстрой адаптации.',
  'Воля и стойкость.',
  'Желание получить признание.',
  3
),
(
  1,
  'Как помогают трудности в процессе обучения?',
  'Трудности помогают развить творческий подход к решению проблем.',
  'Трудности закаляют характер и помогают научиться преодолевать препятствия.',
  'Трудности учат работать в коллективе.',
  'Трудности формируют уверенность в себе.',
  2
),
(
  1,
  'Почему важно получить систематическое образование?',
  'Систематическое образование открывает карьерные перспективы.',
  'Систематическое образование помогает развить личные качества.',
  'Систематическое образование важно для успешной работы в команде.',
  'Только систематическое образование может сделать доступным всё духовное богатство мира.',
  4
),
(
  1,
  'Что помогает человеку достичь целей в профессиональной сфере?',
  'Умение работать в разных областях.',
  'Способность к самообразованию.',
  'Систематическое образование и упорный труд.',
  'Чувство ответственности.',
  3
);

-- Вопросы ко второму тексту (id=2)
INSERT INTO question (text_id, question_text, option1, option2, option3, option4, correct_option_index)
VALUES
(
  2,
  'Как нужно относиться к миру Природы, к миру живого, населяющего нашу Землю?',
  'Нужно беречь природу и не разрушать её.',
  'Нужно бережно относиться к жизни на Земле и уважать её разнообразие.',
  'Природу следует активно исследовать и изучать.',
  'Необходимо развивать экологические технологии.',
  2
),
(
  2,
  'Какой вред наносит человек миру Природы?',
  'Человек разрушает среду обитания животных и загрязняет окружающую среду.',
  'Человек защищает природу от загрязнений.',
  'Человек улучшает экологию планеты.',
  'Человек уничтожает редкие виды животных.',
  1
),
(
  2,
  'Почему человеку необходимо беречь свою планету?',
  'Планета предоставляет воду, воздух, тепло и радость жизни, поддерживая все формы жизни.',
  'Планета даёт человеку всё необходимое для жизни.',
  'Планета позволяет людям путешествовать в космос.',
  'Планета помогает людям бороться с болезнями.',
  1
),
(
  2,
  'Кто или что стоит во главе всего сущего?',
  'Земля.',
  'Природа.',
  'Человек.',
  'Животные.',
  3
),
(
  2,
  'Почему человечество ждет высадки на другие планеты?',
  'Чтобы найти новые ресурсы.',
  'Чтобы расширить популяцию.',
  'Автор не призывает высаживаться на другие планеты.',
  'Вопрос не рассматривается в тексте.',
  3
);


-- Вопросы к третьему тексту (id=3)
INSERT INTO question (text_id, question_text, option1, option2, option3, option4, correct_option_index)
VALUES
(
  3,
  'В каких поступках раскрывает характер человека?',
  'Поступки, направленные на достижение личных целей.',
  'Поступки, когда человек проявляет заботу о других, даже если это требует жертв и усилий.',
  'Поступки, проявляющие честность и порядочность.',
  'Поступки, связанные с помощью нуждающимся.',
  2
),
(
  3,
  'Что значит быть неравнодушным человеком?',
  'Не вмешиваться в чужие дела.',
  'Заботиться о других и помогать, когда это необходимо.',
  'Игнорировать чужие проблемы.',
  'Оставлять других в беде.',
  2
),
(
  3,
  'Чему нас может научить старшее поколение?',
  'Жить по принципам справедливости.',
  'Быть заботливыми и внимательными.',
  'Стремиться к успеху и карьерному росту.',
  'роявлять доброту и человечность к окружающим.',
  4
),
(
  3,
  'Почему важно помогать окружающим?',
  'Помощь другим укрепляет моральные ценности и делает мир лучше.',
  'Помощь делает нас счастливыми.',
  'Помощь может привести к профессиональному успеху.',
  'Помощь укрепляет нашу репутацию.',
  1
),
(
  3,
  'Что называют нравственным выбором?',
  'Выбор, который принесёт материальные блага.',
  'Выбор, основанный на личных интересах.',
  'Выбор, который не вызывает внутреннего конфликта.',
  'Выбор, в котором человек руководствуется добром и ответственностью перед другими.',
  4
);

-- Вопросы к четвертому тексту (id=4)
INSERT INTO question (text_id, question_text, option1, option2, option3, option4, correct_option_index)
VALUES
(
  4,
  'Какое значение имеет первая любовь в жизни человека?',
  'Первая любовь оставляет след в сердце, который может повлиять на дальнейшую жизнь и восприятие отношений.',
  'Первая любовь становится важной вехой в становлении человека.',
  'Первая любовь формирует личные предпочтения на всю жизнь.',
  'Первая любовь всегда приносит счастье.',
  1
),
(
  4,
  'Какую роль играет юность в жизни человека?',
  'Юность — это время самопознания и формирования жизненных целей.',
  'Юность — это время беззаботных развлечений и отдыха.',
  'Юность — это период поиска смысла жизни и формирования ценностей.',
  'Юность определяет материальный успех в жизни.',
  3
),
(
  4,
  'Каковы последствия упущенных возможностей?',
  'Упущенные возможности могут оставить сожаления и чувство незавершенности.',
  'Упущенные возможности открывают новые перспективы.',
  'Упущенные возможности приводят к сожалениям и внутреннему конфликту.',
  'Упущенные возможности не влияют на дальнейшую жизнь.',
  1
),
(
  4,
  'Почему нужно ценить время?',
  'Время даёт возможность накопить богатство.',
  'Время позволяет достичь успеха.',
  'Время — это ресурс, который нельзя вернуть, и каждый момент имеет значение в жизни человека.',
  'Время невозможно вернуть, и упущенные моменты не восполнить.',
  3
),
(
  4,
  'Какого цвета были глаза у женщины, которой автор отдал цветы?',
  'Карие.',
  'Коричневые',
  'Серые.',
  'В тексте нет уточнения',
  3
);
